fe32/tutorials/rheoTestFoam/HerschelBulkley/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{   
                type            HerschelBulkley;
                                
                eta0            eta0  [ 1 -1 -1 0 0 0 0 ] 0.15; 
   		tau0            tau0  [ 1 -1 -2 0 0 0 0 ] .0175; 
   		k               k     [ 1 -1 -1 0 0 0 0 ] 8.9721e-3; 
   		n               n     [ 0 0 0 0 0 0 0 ] 0.8601; 

	    //  Place-holder variables in rheoTestFoam
                uTauCoupling    false;
                rho             rho   [1 -3 0 0 0 0 0] 1050;           
}

rheoTestFoamParameters
{
              // Ramp mode (true) or transient mode (false)
                ramp 		 true; 

              // This tensor multiplied by gammaEpsilonDot gives nabla(U)
                gradU            ( 0.   0.   0.
                                   1.   0.   0.
                                   0.   0.   0.); 

              // Either strain rate or extensional rate (1/s) list (if ramp=false, only the first value in the list is read) 
                gammaEpsilonDotL 
                  (
                        0.01
			0.02
			0.03
			0.04
			0.05
			0.06
			0.07
			0.08
			0.09
			0.1
			0.11
			0.12
			0.13
			0.14
			0.15
			0.16
			0.17
			0.18
			0.19
			0.2
			0.3
			0.4
			0.5
			0.6
			0.7
			0.8
			0.9
			1
			2
			3
			4
			5
			6
			7
			8
			9
			10
			20
			30
			40
			50
			60
			70
			80
			90
			100
			200
			300
			400
			500
			600
			700
			800
			900
			1000
			2000
			3000
			4000
			5000
			6000
			7000
			8000
			9000
			10000
                 
                  );
}
// ************************************************************************* //
